/*****************************************************************************************
sw_feature.h
~~~~~~~~~~~~~~~~~~~~~~~~~

@ Project : AirQuant
@ Date : 2024-02-24
@ Author : Piquant
*****************************************************************************************/

#ifndef _SW_FEATURE_TEST_H_
#define _SW_FEATURE_TEST_H_

/*--------------------------------------------------------------------------------------*/
/*                DEFINITION                                                            */
/*--------------------------------------------------------------------------------------*/
#define DEBUG_MODE               /* 디버그 콘솔 사용할 건지 */

/*--------------------------------------------------------------------------------------*/
/*                Version Info                                                          */
/*--------------------------------------------------------------------------------------*/
#define BUILD_DATE "2024.02.23" //빌드한 날짜
#define VER_MAJOR 0             //ex) 2.X.X
#define VER_MINOR 0             //ex) X.2.X
#define VER_MINOR2 1            //ex) X.X.0


//#define NO_CONNECT_ADVERTISING
#define USE_3LED
#define USE_SCD30_CO2
//#define USE_RX9_CO2
//#define USE_SLEEP_CONTROL


#endif /* _SW_FEATURE_TEST_H_ */
